import { Environment } from '@react-three/drei'
import { Canvas } from '@react-three/fiber'
import React from 'react'
import Ram from '../../components/3d-Render/components/ram'

function DetailRam() {
  return (
    <>
      <Canvas  shadows camera={{ position: [1,1, 1], fov: 100 }}>
            <Ram/>
        <Environment preset="sunset" />
    </Canvas>
    <div className="container">
    <h1>Ram</h1>
    <p>Ram (Random-access memory) หรือ แรม เป็นหน่วยความจำหลักของคอมพิวเตอร์ ซึ่งเป็นองค์ประกอบสำคัญที่มีผลต่อประสิทธิภาพการทำงานโดยรวม ทั้งยังส่งผลต่อความเร็วในการทำงานของระบบคอมพิวเตอร์ ไม่ว่าอุปกรณ์ชนิดนั้นจะเป็นสมาร์ทโฟน, แท็บเล็ต, คอมพิวเตอร์ หรืออุปกรณ์ใดๆ ที่จำเป็นต้องอ่านและเขียนคำสั่งไปยังหน่วยความจำ</p>
    <p >
    RAM จัดว่าเป็นหน่วยความจำชั่วคราว (Short-Term Memory) โดยการทำงานของมันนั้นจะเป็นการเขียนหรือบันทึกข้อมูลแบบสุ่ม ซึ่งหน่วยความจำชนิดนี้จะสามารถบันทึกข้อมูลลงในตำแหน่งต่างๆ ได้อย่างอิสระ ทั้งนี้ก็เพื่อเพิ่มความเร็วในการบันทึกและอ่านข้อมูล จึงเป็นที่มาของคำว่า Random access ขณะเดียวกันก็ทำให้มันแตกต่างจากหน่วยความจำประเภทอื่นๆ อย่างสิ้นเชิง เมื่อเทียบกับฮาร์ดไดร์ฟ (Hard Drive) หรือ SSD (ที่รู้จักกันในนามของ Direct Access Memory) สิ่งที่ทำให้มันแตกต่างจากหน่วยความจำที่เข้าถึงได้โดยตรงนั่นก็คือ เมื่อมีการตัดกระแสไฟฟ้าหรือปิดคอมพิวเตอร์ ข้อมูลที่อยู่ภายใน Ram ก็จะหายไปอย่างสมบูรณ์    </p>
    <p>
    เนื่องจากลักษณะเฉพาะของมัน ข้อมูลที่ถูกจัดการโดย RAM จึงมีการเปลี่ยนแปลงหรือผันผวนอยู่ตลอดเวลา และมีการประมวลผลที่เกิดขึ้นเฉพาะในช่วงเวลาที่กำหนดเท่านั้น    </p>
    <p>
    ปัจจุบัน โมดูล Ram รูปแบบใหม่กำลังได้รับการพัฒนาอย่างต่อเนื่อง เพื่อให้สามารถจัดเก็บงาน (Task) อื่นๆ ซึ่งหมายถึงการดำเนินการบางอย่าง เช่น การเริ่มต้นระบบ (System Start Up) ที่อาจเกิดได้เร็วขึ้นกว่าเดิมเนื่องจากการกระทำเหล่านั้นได้มีการเตรียมพร้อมสำหรับเรียกใช้    </p>    
    <p>
    RAM มีหน้าที่ในการเก็บชุดคำสั่งและข้อมูลในขณะที่ระบบคอมพิวเตอร์กำลังทำงานอยู่ ทั้งในแบบของ Input และ Output โดยการเข้าถึงข้อมูลของ RAM นั้นจะเป็นการเข้าถึงแบบสุ่ม (Random Access) ซึ่งหมายถึง CPU สามารถเข้าถึงทุกๆ ส่วนของหน่วยความจำหรือพื้นที่เก็บข้อมูลได้โดยตรง เพื่อเพิ่มความเร็วในกระบวนการเขียนและอ่านข้อมูลอย่างต่อเนื่อง</p>   
    </div>

  </>
  )
}

export default DetailRam